import math

print('----------{ คำนวณหาพื้นที่เรขาคณิต }----------')
shape = input('ต้องการหาพื้นที่ของ วงกลม(c) สามเหลี่ยม(t) หรือสี่เหลี่ยม(r): ')

print('--------------------------------------------')
if shape == 'c':
  r = float(input('ป้อนรัศมีของวงกลม: '))
  area = 3.14 * r * r
  print('รูปวงกลมมีพื้นที่', area, 'ตารางหน่วย')
elif shape == 't':
  b = float(input('ป้อนความยาวฐาน: '))
  h = float(input('ป้อนความสูง: '))
  area = (1 / 2) * b * h
  print('รูปสามเหลี่ยมมีพื้นที่', area, 'ตารางหน่วย')
elif shape == 'r':
  w = float(input('ป้อนความกว้าง: '))
  l = float(input('ป้อนความยาว: '))
  area = w * l
  print('รูปสี่เหลี่ยมมีพื้นที่', area, 'ตารางหน่วย')
else:
  print('กรุณาพิมพ์ c , r , t เท่านั่น')

print('--------------------------------------------')